[Survived] StringLiteral
app/components/LoginForm/LoginForm.tsx:4:16
 import React, { useState } from 'react';
 import axios from 'axios';
 
-const apiUrl = 'http://35.233.79.129/auth'
+const apiUrl = ""
 
 export const LoginForm = () => {

[Killed] ObjectLiteral
app/components/LoginForm/LoginForm.tsx:18:18
   const [error, setError] = useState<boolean>(initValue.error);
 
   const signUpHandler = (username: string, password: string) => {
-    const data = {
-      username,
-      password,
-    };
+    const data = {};
 
     const checkData = Object.entries(data).length !== 0;

[Killed] BlockStatement
app/components/LoginForm/LoginForm.tsx:25:20
 
     const checkData = Object.entries(data).length !== 0;
     
-    if (checkData) {
-      const checkUsername = Boolean(username.length === 0)
-      const checkPassword = Boolean(password.length === 0)
-
-      if (checkUsername || checkPassword) {
-        setError(true);
-      } else {
-        axios
-          .post(apiUrl, data)
-          .then((response) => {
-            console.log(response);
-            const token = response.data.token;
-            localStorage.setItem('user', JSON.stringify(token));
-          })
-          .catch((error) => {
-            console.log(error);
-          });
-      }
-    } else {
+    if (checkData) {} else {
       setError(true);
     }

[Killed] EqualityOperator
app/components/LoginForm/LoginForm.tsx:26:37
     const checkData = Object.entries(data).length !== 0;
     
     if (checkData) {
-      const checkUsername = Boolean(username.length === 0)
+      const checkUsername = Boolean(username.length !== 0)
       const checkPassword = Boolean(password.length === 0)
 

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:26:37
     const checkData = Object.entries(data).length !== 0;
     
     if (checkData) {
-      const checkUsername = Boolean(username.length === 0)
+      const checkUsername = Boolean(true)
       const checkPassword = Boolean(password.length === 0)
 

[Killed] EqualityOperator
app/components/LoginForm/LoginForm.tsx:27:37
     
     if (checkData) {
       const checkUsername = Boolean(username.length === 0)
-      const checkPassword = Boolean(password.length === 0)
+      const checkPassword = Boolean(password.length !== 0)
 
       if (checkUsername || checkPassword) {

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:27:37
     
     if (checkData) {
       const checkUsername = Boolean(username.length === 0)
-      const checkPassword = Boolean(password.length === 0)
+      const checkPassword = Boolean(true)
 
       if (checkUsername || checkPassword) {

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:29:11
       const checkUsername = Boolean(username.length === 0)
       const checkPassword = Boolean(password.length === 0)
 
-      if (checkUsername || checkPassword) {
+      if (false) {
         setError(true);
       } else {

[Killed] ArrowFunction
app/components/LoginForm/LoginForm.tsx:51:66
   return (
     <div>
       <div>
-        <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
+        <p> <input placeholder='Name' value={username} onChange={() => undefined} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
         {error && <p> Username or password cannot be empty string </p>}

[Killed] LogicalOperator
app/components/LoginForm/LoginForm.tsx:53:10
       <div>
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
-        {error && <p> Username or password cannot be empty string </p>}
+        {error || <p> Username or password cannot be empty string </p>}
         <button onClick={() => signUpHandler(username, password)}> Sign in </button>
       </div>

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:53:10
       <div>
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
-        {error && <p> Username or password cannot be empty string </p>}
+        {true}
         <button onClick={() => signUpHandler(username, password)}> Sign in </button>
       </div>

[Killed] ArrowFunction
app/components/LoginForm/LoginForm.tsx:54:26
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
         {error && <p> Username or password cannot be empty string </p>}
-        <button onClick={() => signUpHandler(username, password)}> Sign in </button>
+        <button onClick={() => undefined}> Sign in </button>
       </div>
     </div>
