[Survived] StringLiteral
app/components/SignUpForm/SignUpForm.tsx:6:16
 
 import {nameIsValid, emailIsValid, passwordIsValid } from '../validation';
 
-const apiUrl = 'http://35.233.79.129'
+const apiUrl = ""
 
 export const SignUpForm = () => {

[Killed] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:15:106
   const [confirmPassword, setConfirmPassword] = useState<string>('');
   const [error, setError] = useState<boolean>(false);
 
-  const signUpHandler = ( username: string, email: string, password: string, confirmPassword: string) => {
-    console.log( 'name:', username, 'email:', email, 'password:', password, 'confirmPassword:', confirmPassword );
-
-    const checkedUsername = nameIsValid(username);
-    const checkedEmail = emailIsValid(email);
-    const checkedPassword = passwordIsValid(password);
-
-    if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
-      setError(true);
-    } else {
-      axios.post(apiUrl + '/user', { username, password, email, role: 'user'})
-      .then((response) => {
-        
-        console.log(response);
-      })
-      .catch((error) => {
-        console.log(error);
-      });
-    }
-  };
+  const signUpHandler = ( username: string, email: string, password: string, confirmPassword: string) => {};
 
   return (

[Survived] StringLiteral
app/components/SignUpForm/SignUpForm.tsx:16:18
   const [error, setError] = useState<boolean>(false);
 
   const signUpHandler = ( username: string, email: string, password: string, confirmPassword: string) => {
-    console.log( 'name:', username, 'email:', email, 'password:', password, 'confirmPassword:', confirmPassword );
+    console.log( "", username, 'email:', email, 'password:', password, 'confirmPassword:', confirmPassword );
 
     const checkedUsername = nameIsValid(username);

[Survived] StringLiteral
app/components/SignUpForm/SignUpForm.tsx:16:77
   const [error, setError] = useState<boolean>(false);
 
   const signUpHandler = ( username: string, email: string, password: string, confirmPassword: string) => {
-    console.log( 'name:', username, 'email:', email, 'password:', password, 'confirmPassword:', confirmPassword );
+    console.log( 'name:', username, 'email:', email, 'password:', password, "", confirmPassword );
 
     const checkedUsername = nameIsValid(username);

[Killed] ConditionalExpression
app/components/SignUpForm/SignUpForm.tsx:22:10
     const checkedEmail = emailIsValid(email);
     const checkedPassword = passwordIsValid(password);
 
-    if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
+    if ( false) {
       setError(true);
     } else {

[Killed] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:22:97
     const checkedEmail = emailIsValid(email);
     const checkedPassword = passwordIsValid(password);
 
-    if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
-      setError(true);
-    } else {
+    if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {} else {
       axios.post(apiUrl + '/user', { username, password, email, role: 'user'})
       .then((response) => {

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:24:12
 
     if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
       setError(true);
-    } else {
-      axios.post(apiUrl + '/user', { username, password, email, role: 'user'})
-      .then((response) => {
-        
-        console.log(response);
-      })
-      .catch((error) => {
-        console.log(error);
-      });
-    }
+    } else {}
   };
 

[Survived] ObjectLiteral
app/components/SignUpForm/SignUpForm.tsx:25:36
     if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
       setError(true);
     } else {
-      axios.post(apiUrl + '/user', { username, password, email, role: 'user'})
+      axios.post(apiUrl + '/user', {})
       .then((response) => {
         

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:26:27
       setError(true);
     } else {
       axios.post(apiUrl + '/user', { username, password, email, role: 'user'})
-      .then((response) => {
-        
-        console.log(response);
-      })
+      .then((response) => {})
       .catch((error) => {
         console.log(error);

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:40:66
     <div>
       Sing up form
       <div>
-        <p> <input placeholder='Name' value={username} onChange={e => setUsername(e.target.value)}/> </p>
+        <p> <input placeholder='Name' value={username} onChange={() => undefined}/> </p>
         <p> <input placeholder='Email' value={email} onChange={e => setEmail(e.target.value)}/> </p>
         <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:41:64
       Sing up form
       <div>
         <p> <input placeholder='Name' value={username} onChange={e => setUsername(e.target.value)}/> </p>
-        <p> <input placeholder='Email' value={email} onChange={e => setEmail(e.target.value)}/> </p>
+        <p> <input placeholder='Email' value={email} onChange={() => undefined}/> </p>
         <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>
         <p> <input placeholder='Confirm' value={confirmPassword} onChange={e => setConfirmPassword(e.target.value)}/> </p>

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:42:70
       <div>
         <p> <input placeholder='Name' value={username} onChange={e => setUsername(e.target.value)}/> </p>
         <p> <input placeholder='Email' value={email} onChange={e => setEmail(e.target.value)}/> </p>
-        <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>
+        <p> <input placeholder='Password' value={password} onChange={() => undefined}/> </p>
         <p> <input placeholder='Confirm' value={confirmPassword} onChange={e => setConfirmPassword(e.target.value)}/> </p>
         <button onClick={() => signUpHandler(username, email, password, confirmPassword)}> Sign up </button>

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:43:76
         <p> <input placeholder='Name' value={username} onChange={e => setUsername(e.target.value)}/> </p>
         <p> <input placeholder='Email' value={email} onChange={e => setEmail(e.target.value)}/> </p>
         <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>
-        <p> <input placeholder='Confirm' value={confirmPassword} onChange={e => setConfirmPassword(e.target.value)}/> </p>
+        <p> <input placeholder='Confirm' value={confirmPassword} onChange={() => undefined}/> </p>
         <button onClick={() => signUpHandler(username, email, password, confirmPassword)}> Sign up </button>
         {error && <p> Data is not correct </p>}

[Killed] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:44:26
         <p> <input placeholder='Email' value={email} onChange={e => setEmail(e.target.value)}/> </p>
         <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>
         <p> <input placeholder='Confirm' value={confirmPassword} onChange={e => setConfirmPassword(e.target.value)}/> </p>
-        <button onClick={() => signUpHandler(username, email, password, confirmPassword)}> Sign up </button>
+        <button onClick={() => undefined}> Sign up </button>
         {error && <p> Data is not correct </p>}
       </div>

[Killed] LogicalOperator
app/components/SignUpForm/SignUpForm.tsx:45:10
         <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>
         <p> <input placeholder='Confirm' value={confirmPassword} onChange={e => setConfirmPassword(e.target.value)}/> </p>
         <button onClick={() => signUpHandler(username, email, password, confirmPassword)}> Sign up </button>
-        {error && <p> Data is not correct </p>}
+        {error || <p> Data is not correct </p>}
       </div>
     </div>

[Killed] ConditionalExpression
app/components/SignUpForm/SignUpForm.tsx:45:10
         <p> <input placeholder='Password' value={password} onChange={e => setPassword(e.target.value)}/> </p>
         <p> <input placeholder='Confirm' value={confirmPassword} onChange={e => setConfirmPassword(e.target.value)}/> </p>
         <button onClick={() => signUpHandler(username, email, password, confirmPassword)}> Sign up </button>
-        {error && <p> Data is not correct </p>}
+        {true}
       </div>
     </div>
