[Survived] BlockStatement
src/app/views/Login.tsx:4:28
 import React from 'react';
 import { LoginForm } from '../components';
 
-export const Login = () => {
-  return (
-      <>
-          <h1>
-              login
-          </h1>
-          <h2>
-              page
-          </h2>
-          <LoginForm />
-      </>
-  )
-};
+export const Login = () => {};
 
