[Survived] StringLiteral
src/app/routes/routes.tsx:25:15
     },
 
     {
-        path: '/test',
+        path: "",
         auth: true,
         component: view.Test,

[Survived] BooleanLiteral
src/app/routes/routes.tsx:26:15
 
     {
         path: '/test',
-        auth: true,
+        auth: false,
         component: view.Test,
     },
