[Survived] StringLiteral
app/components/LoginForm/LoginForm.tsx:6:16
 import axios from 'axios';
 import './LoginForm.scss';
 
-const apiUrl = 'http://35.233.79.129/auth';
+const apiUrl = "";
 
 export const LoginForm = () => {

[Killed] BooleanLiteral
app/components/LoginForm/LoginForm.tsx:12:12
   const initValue = {
     username: '',
     password: '',
-    error: false,
+    error: true,
   };
 

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:25:23
       password,
     };
 
-    const checkData = Object.entries(data).length !== 0;
+    const checkData = false;
 
     if (checkData) {

[Killed] EqualityOperator
app/components/LoginForm/LoginForm.tsx:25:23
       password,
     };
 
-    const checkData = Object.entries(data).length !== 0;
+    const checkData = Object.entries(data).length === 0;
 
     if (checkData) {

[Killed] BlockStatement
app/components/LoginForm/LoginForm.tsx:27:20
 
     const checkData = Object.entries(data).length !== 0;
 
-    if (checkData) {
-      const checkUsername = Boolean(username.length === 0);
-      const checkPassword = Boolean(password.length === 0);
-
-      if (checkUsername || checkPassword) {
-        setError(true);
-      } else {
-        axios
-          .post(apiUrl, data)
-          .then((response) => {
-            console.log(response);
-            const token = response.data.token;
-            localStorage.setItem('user', JSON.stringify(token));
-          })
-          .catch((error) => {
-            console.log(error);
-          });
-      }
-    } else {
+    if (checkData) {} else {
       setError(true);
     }

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:27:9
 
     const checkData = Object.entries(data).length !== 0;
 
-    if (checkData) {
+    if (false) {
       const checkUsername = Boolean(username.length === 0);
       const checkPassword = Boolean(password.length === 0);

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:28:37
     const checkData = Object.entries(data).length !== 0;
 
     if (checkData) {
-      const checkUsername = Boolean(username.length === 0);
+      const checkUsername = Boolean(true);
       const checkPassword = Boolean(password.length === 0);
 

[Killed] EqualityOperator
app/components/LoginForm/LoginForm.tsx:28:37
     const checkData = Object.entries(data).length !== 0;
 
     if (checkData) {
-      const checkUsername = Boolean(username.length === 0);
+      const checkUsername = Boolean(username.length !== 0);
       const checkPassword = Boolean(password.length === 0);
 

[Killed] EqualityOperator
app/components/LoginForm/LoginForm.tsx:29:37
 
     if (checkData) {
       const checkUsername = Boolean(username.length === 0);
-      const checkPassword = Boolean(password.length === 0);
+      const checkPassword = Boolean(password.length !== 0);
 
       if (checkUsername || checkPassword) {

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:29:37
 
     if (checkData) {
       const checkUsername = Boolean(username.length === 0);
-      const checkPassword = Boolean(password.length === 0);
+      const checkPassword = Boolean(true);
 
       if (checkUsername || checkPassword) {

[Killed] BlockStatement
app/components/LoginForm/LoginForm.tsx:31:43
       const checkUsername = Boolean(username.length === 0);
       const checkPassword = Boolean(password.length === 0);
 
-      if (checkUsername || checkPassword) {
-        setError(true);
-      } else {
+      if (checkUsername || checkPassword) {} else {
         axios
           .post(apiUrl, data)

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:31:11
       const checkUsername = Boolean(username.length === 0);
       const checkPassword = Boolean(password.length === 0);
 
-      if (checkUsername || checkPassword) {
+      if (true) {
         setError(true);
       } else {

[Killed] BooleanLiteral
app/components/LoginForm/LoginForm.tsx:32:18
       const checkPassword = Boolean(password.length === 0);
 
       if (checkUsername || checkPassword) {
-        setError(true);
+        setError(false);
       } else {
         axios

[Survived] BlockStatement
app/components/LoginForm/LoginForm.tsx:33:14
 
       if (checkUsername || checkPassword) {
         setError(true);
-      } else {
-        axios
-          .post(apiUrl, data)
-          .then((response) => {
-            console.log(response);
-            const token = response.data.token;
-            localStorage.setItem('user', JSON.stringify(token));
-          })
-          .catch((error) => {
-            console.log(error);
-          });
-      }
+      } else {}
     } else {
       setError(true);

[Survived] BlockStatement
app/components/LoginForm/LoginForm.tsx:36:31
       } else {
         axios
           .post(apiUrl, data)
-          .then((response) => {
-            console.log(response);
-            const token = response.data.token;
-            localStorage.setItem('user', JSON.stringify(token));
-          })
+          .then((response) => {})
           .catch((error) => {
             console.log(error);

[Survived] BlockStatement
app/components/LoginForm/LoginForm.tsx:45:12
             console.log(error);
           });
       }
-    } else {
-      setError(true);
-    }
+    } else {}
   };
 

[Survived] BooleanLiteral
app/components/LoginForm/LoginForm.tsx:46:16
           });
       }
     } else {
-      setError(true);
+      setError(false);
     }
   };

[Killed] ArrowFunction
app/components/LoginForm/LoginForm.tsx:55:66
     <div className='signInForm'>
       <div className='signInFormInpt'>
         <p className='signInFormTitle'> Login </p>
-        <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
+        <p> <input placeholder='Name' value={username} onChange={() => undefined} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
         {error && <p className = 'signUpFormError'> Username or password cannot be empty string </p>}

[Killed] ArrowFunction
app/components/LoginForm/LoginForm.tsx:56:70
       <div className='signInFormInpt'>
         <p className='signInFormTitle'> Login </p>
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
-        <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
+        <p> <input placeholder='Password' value={password} onChange={() => undefined} /> </p>
         {error && <p className = 'signUpFormError'> Username or password cannot be empty string </p>}
         <button className='signInFormBtn' onClick={() => signUpHandler(username, password)}> Sign in </button>

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:57:10
         <p className='signInFormTitle'> Login </p>
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
-        {error && <p className = 'signUpFormError'> Username or password cannot be empty string </p>}
+        {true}
         <button className='signInFormBtn' onClick={() => signUpHandler(username, password)}> Sign in </button>
       </div>

[Killed] ConditionalExpression
app/components/LoginForm/LoginForm.tsx:57:10
         <p className='signInFormTitle'> Login </p>
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
-        {error && <p className = 'signUpFormError'> Username or password cannot be empty string </p>}
+        {false}
         <button className='signInFormBtn' onClick={() => signUpHandler(username, password)}> Sign in </button>
       </div>

[Killed] ArrowFunction
app/components/LoginForm/LoginForm.tsx:58:52
         <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
         <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
         {error && <p className = 'signUpFormError'> Username or password cannot be empty string </p>}
-        <button className='signInFormBtn' onClick={() => signUpHandler(username, password)}> Sign in </button>
+        <button className='signInFormBtn' onClick={() => undefined}> Sign in </button>
       </div>
       <div className='signInFormWrapper'>

[Survived] StringLiteral
app/components/LoginForm/LoginForm.tsx:61:19
         <button className='signInFormBtn' onClick={() => signUpHandler(username, password)}> Sign in </button>
       </div>
       <div className='signInFormWrapper'>
-        <img src={`${process.env.PUBLIC_URL}/img/login.png`} alt='login' className='signInFormImg' />
+        <img src={``} alt='login' className='signInFormImg' />
         <p className='signInFormLinkWrapper'> <Link to='/signup' className='signInFormLink'> Create an account </Link> </p>
       </div>
