[Survived] BlockStatement
src/app/views/SignUp.tsx:4:29
 import React from 'react';
 import { SignUpForm } from '../components';
 
-export const SignUp = () => {
-  return (
-    <div>
-      Sing up form
-      <div>
-        <SignUpForm />
-      </div>
-    </div>
-  );
-};
+export const SignUp = () => {};
 
