[Survived] BlockStatement
src/app/views/Test.tsx:3:27
 import React, { Fragment } from 'react';
 
-export const Test = () => {
-  return (
-      <>
-          <h1>
-              Test
-          </h1>
-          <h2>
-              Test
-          </h2>
-      </>
-  )
-};
+export const Test = () => {};
 
