[Survived] BlockStatement
app/components/Game/Game.tsx:4:27
 import React from 'react';
 import './Game.scss';
 
-export const Game = () => {
-    return (
-        <div className = 'game'>
-            Game
-        </div>
-    )
-}
+export const Game = () => {}
