[Survived] StringLiteral
app/components/SignUpForm/SignUpForm.tsx:13:52
 export const SignUpForm = () => {
   const [username, setUsername] = useState<string>('');
   const [email, setEmail] = useState<string>('');
-  const [password, setPassword] = useState<string>('');
+  const [password, setPassword] = useState<string>("Stryker was here!");
   const [confirmPassword, setConfirmPassword] = useState<string>('');
   const [error, setError] = useState<boolean>(false);

[Killed] BooleanLiteral
app/components/SignUpForm/SignUpForm.tsx:15:47
   const [email, setEmail] = useState<string>('');
   const [password, setPassword] = useState<string>('');
   const [confirmPassword, setConfirmPassword] = useState<string>('');
-  const [error, setError] = useState<boolean>(false);
+  const [error, setError] = useState<boolean>(true);
 
   const signUpHandler = (username: string, email: string, password: string, confirmPassword: string ) => {

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:17:106
   const [confirmPassword, setConfirmPassword] = useState<string>('');
   const [error, setError] = useState<boolean>(false);
 
-  const signUpHandler = (username: string, email: string, password: string, confirmPassword: string ) => {
-    const checkedUsername = nameIsValid(username);
-    const checkedEmail = emailIsValid(email);
-    const checkedPassword = passwordIsValid(password);
-
-    if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
-      setError(true);
-    } else {
-      if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
-        setError(true);
-      } else {
-        axios
-          .post(apiUrl + '/user', { username, password, email, role: 'user' })
-          .then((response) => {
-            console.log(response);
-          })
-          .catch((error) => {
-            console.log(error);
-          });
-      }
-    }
-  };
+  const signUpHandler = (username: string, email: string, password: string, confirmPassword: string ) => {};
 
   return (

[Survived] ConditionalExpression
app/components/SignUpForm/SignUpForm.tsx:22:35
     const checkedEmail = emailIsValid(email);
     const checkedPassword = passwordIsValid(password);
 
-    if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
+    if (username === undefined || false || password === undefined || confirmPassword === undefined) {
       setError(true);
     } else {

[Survived] ConditionalExpression
app/components/SignUpForm/SignUpForm.tsx:22:84
     const checkedEmail = emailIsValid(email);
     const checkedPassword = passwordIsValid(password);
 
-    if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
+    if (username === undefined || email === undefined || password === undefined || true) {
       setError(true);
     } else {

[Survived] BooleanLiteral
app/components/SignUpForm/SignUpForm.tsx:23:16
     const checkedPassword = passwordIsValid(password);
 
     if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
-      setError(true);
+      setError(false);
     } else {
       if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:24:12
 
     if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
       setError(true);
-    } else {
-      if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
-        setError(true);
-      } else {
-        axios
-          .post(apiUrl + '/user', { username, password, email, role: 'user' })
-          .then((response) => {
-            console.log(response);
-          })
-          .catch((error) => {
-            console.log(error);
-          });
-      }
-    }
+    } else {}
   };
 

[Survived] BooleanLiteral
app/components/SignUpForm/SignUpForm.tsx:25:12
     if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
       setError(true);
     } else {
-      if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
+      if ( checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
         setError(true);
       } else {

[Survived] ConditionalExpression
app/components/SignUpForm/SignUpForm.tsx:25:12
     if (username === undefined || email === undefined || password === undefined || confirmPassword === undefined) {
       setError(true);
     } else {
-      if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
+      if ( true) {
         setError(true);
       } else {

[Survived] BooleanLiteral
app/components/SignUpForm/SignUpForm.tsx:26:18
       setError(true);
     } else {
       if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
-        setError(true);
+        setError(false);
       } else {
         axios

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:27:14
     } else {
       if ( !checkedUsername || !checkedEmail || !checkedPassword || password !== confirmPassword) {
         setError(true);
-      } else {
-        axios
-          .post(apiUrl + '/user', { username, password, email, role: 'user' })
-          .then((response) => {
-            console.log(response);
-          })
-          .catch((error) => {
-            console.log(error);
-          });
-      }
+      } else {}
     }
   };

[Survived] StringLiteral
app/components/SignUpForm/SignUpForm.tsx:29:70
         setError(true);
       } else {
         axios
-          .post(apiUrl + '/user', { username, password, email, role: 'user' })
+          .post(apiUrl + '/user', { username, password, email, role: "" })
           .then((response) => {
             console.log(response);

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:30:31
       } else {
         axios
           .post(apiUrl + '/user', { username, password, email, role: 'user' })
-          .then((response) => {
-            console.log(response);
-          })
+          .then((response) => {})
           .catch((error) => {
             console.log(error);

[Survived] BlockStatement
app/components/SignUpForm/SignUpForm.tsx:33:29
           .then((response) => {
             console.log(response);
           })
-          .catch((error) => {
-            console.log(error);
-          });
+          .catch((error) => {});
       }
     }

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:46:70
         <div className='signUpForm'>
           <div className='signUpFormInpt'>
             <p className='signUpFormTitle'> Registration </p>
-            <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
+            <p> <input placeholder='Name' value={username} onChange={() => undefined} /> </p>
             <p> <input placeholder='Email' value={email} onChange={(e) => setEmail(e.target.value)} /> </p>
             <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:47:68
           <div className='signUpFormInpt'>
             <p className='signUpFormTitle'> Registration </p>
             <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
-            <p> <input placeholder='Email' value={email} onChange={(e) => setEmail(e.target.value)} /> </p>
+            <p> <input placeholder='Email' value={email} onChange={() => undefined} /> </p>
             <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
             <p> <input placeholder='Confirm' value={confirmPassword} onChange={(e) => setConfirmPassword(e.target.value)} /> </p>

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:48:74
             <p className='signUpFormTitle'> Registration </p>
             <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
             <p> <input placeholder='Email' value={email} onChange={(e) => setEmail(e.target.value)} /> </p>
-            <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
+            <p> <input placeholder='Password' value={password} onChange={() => undefined} /> </p>
             <p> <input placeholder='Confirm' value={confirmPassword} onChange={(e) => setConfirmPassword(e.target.value)} /> </p>
             <button className='signUpFormBtn' onClick={() => signUpHandler(username, email, password, confirmPassword)} > Sign up </button>

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:49:80
             <p> <input placeholder='Name' value={username} onChange={(e) => setUsername(e.target.value)} /> </p>
             <p> <input placeholder='Email' value={email} onChange={(e) => setEmail(e.target.value)} /> </p>
             <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
-            <p> <input placeholder='Confirm' value={confirmPassword} onChange={(e) => setConfirmPassword(e.target.value)} /> </p>
+            <p> <input placeholder='Confirm' value={confirmPassword} onChange={() => undefined} /> </p>
             <button className='signUpFormBtn' onClick={() => signUpHandler(username, email, password, confirmPassword)} > Sign up </button>
             {error && <p className='signUpFormError'> Data is not correct </p>}

[Survived] ArrowFunction
app/components/SignUpForm/SignUpForm.tsx:50:56
             <p> <input placeholder='Email' value={email} onChange={(e) => setEmail(e.target.value)} /> </p>
             <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
             <p> <input placeholder='Confirm' value={confirmPassword} onChange={(e) => setConfirmPassword(e.target.value)} /> </p>
-            <button className='signUpFormBtn' onClick={() => signUpHandler(username, email, password, confirmPassword)} > Sign up </button>
+            <button className='signUpFormBtn' onClick={() => undefined} > Sign up </button>
             {error && <p className='signUpFormError'> Data is not correct </p>}
           </div>

[Killed] LogicalOperator
app/components/SignUpForm/SignUpForm.tsx:51:14
             <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
             <p> <input placeholder='Confirm' value={confirmPassword} onChange={(e) => setConfirmPassword(e.target.value)} /> </p>
             <button className='signUpFormBtn' onClick={() => signUpHandler(username, email, password, confirmPassword)} > Sign up </button>
-            {error && <p className='signUpFormError'> Data is not correct </p>}
+            {error || <p className='signUpFormError'> Data is not correct </p>}
           </div>
           <div className='signUpFormWrapper'>

[Survived] ConditionalExpression
app/components/SignUpForm/SignUpForm.tsx:51:14
             <p> <input placeholder='Password' value={password} onChange={(e) => setPassword(e.target.value)} /> </p>
             <p> <input placeholder='Confirm' value={confirmPassword} onChange={(e) => setConfirmPassword(e.target.value)} /> </p>
             <button className='signUpFormBtn' onClick={() => signUpHandler(username, email, password, confirmPassword)} > Sign up </button>
-            {error && <p className='signUpFormError'> Data is not correct </p>}
+            {false}
           </div>
           <div className='signUpFormWrapper'>
