[Survived] BlockStatement
app/components/User/User.tsx:12:19
   //const [username, ]
   const api = 'http://35.233.79.129/user/sovasova10';
 
-  useEffect(() => {
-    axios
-    .get(api)
-    .then((response) => {
-      console.log(response.data.user);
-    })
-    .catch((error) => {
-      console.log(error);
-    });
-  })
+  useEffect(() => {})
   return (
     <Fragment>

[Survived] BlockStatement
app/components/User/User.tsx:15:25
   useEffect(() => {
     axios
     .get(api)
-    .then((response) => {
-      console.log(response.data.user);
-    })
+    .then((response) => {})
     .catch((error) => {
       console.log(error);
