[Survived] BlockStatement
src/app/routes/index.tsx:12:35
   return (
     <div>
       <Switch>
-        {routes.map((route, i) => {
-          if (isLogin) {
-            return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-          } else {
-            if (route.auth === false) {
-              return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-            } else { 
-                return ( <Redirect to='/login' /> )
-            }
-          }
-        })}
+        {routes.map((route, i) => {})}
       </Switch>
     </div>

[Survived] ConditionalExpression
src/app/routes/index.tsx:13:15
     <div>
       <Switch>
         {routes.map((route, i) => {
-          if (isLogin) {
+          if (true) {
             return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
           } else {

[Survived] BlockStatement
src/app/routes/index.tsx:13:24
     <div>
       <Switch>
         {routes.map((route, i) => {
-          if (isLogin) {
-            return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-          } else {
+          if (isLogin) {} else {
             if (route.auth === false) {
               return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );

[Survived] BlockStatement
src/app/routes/index.tsx:15:18
         {routes.map((route, i) => {
           if (isLogin) {
             return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-          } else {
-            if (route.auth === false) {
-              return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-            } else { 
-                return ( <Redirect to='/login' /> )
-            }
-          }
+          } else {}
         })}
       </Switch>

[Survived] BlockStatement
src/app/routes/index.tsx:16:39
           if (isLogin) {
             return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
           } else {
-            if (route.auth === false) {
-              return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-            } else { 
+            if (route.auth === false) {} else { 
                 return ( <Redirect to='/login' /> )
             }

[Survived] ConditionalExpression
src/app/routes/index.tsx:16:17
           if (isLogin) {
             return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
           } else {
-            if (route.auth === false) {
+            if (true) {
               return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
             } else { 

[Survived] BlockStatement
src/app/routes/index.tsx:18:20
           } else {
             if (route.auth === false) {
               return ( <Route key={i} exact={route.exact} path={route.path} component={route.component} /> );
-            } else { 
-                return ( <Redirect to='/login' /> )
-            }
+            } else {}
           }
         })}
