[Survived] BooleanLiteral
src/app/routes/routes.tsx:7:15
 
     {
         path: '/',
-        auth: false,
+        auth: true,
         component: view.Home,
         exact: true

[Survived] BooleanLiteral
src/app/routes/routes.tsx:9:16
         path: '/',
         auth: false,
         component: view.Home,
-        exact: true
+        exact: false
     },
 

[Survived] ObjectLiteral
src/app/routes/routes.tsx:12:5
         exact: true
     },
 
-    {
-        path: '/signup',
-        auth: false,
-        component: view.SignUp,
-    },
+    {},
 
     {

[Survived] BooleanLiteral
src/app/routes/routes.tsx:14:15
 
     {
         path: '/signup',
-        auth: false,
+        auth: true,
         component: view.SignUp,
     },

[Survived] BooleanLiteral
src/app/routes/routes.tsx:20:15
 
     {
         path: '/login',
-        auth: false,
+        auth: true,
         component: view.Login,
     },

[Survived] StringLiteral
src/app/routes/routes.tsx:25:15
     },
 
     {
-        path: '/profile',
+        path: "",
         auth: true,
         component: view.Profile,

[Survived] BooleanLiteral
src/app/routes/routes.tsx:26:15
 
     {
         path: '/profile',
-        auth: true,
+        auth: false,
         component: view.Profile,
     },

[Survived] StringLiteral
src/app/routes/routes.tsx:31:15
     },
 
     {
-        path: '/edit',
+        path: "",
         auth: true,
         component: view.Edit,

[Survived] BooleanLiteral
src/app/routes/routes.tsx:32:15
 
     {
         path: '/edit',
-        auth: true,
+        auth: false,
         component: view.Edit,
     },

[Survived] BooleanLiteral
src/app/routes/routes.tsx:38:15
 
     {
         path: '/song',
-        auth: true,
+        auth: false,
         component: view.Song,
     },

[Survived] BooleanLiteral
src/app/routes/routes.tsx:44:15
 
     {
         path: '/crossword',
-        auth: true,
+        auth: false,
         component: view.Crossword,
     },

[Survived] StringLiteral
src/app/routes/routes.tsx:49:15
     },
 
     {
-        path: '/millionare',
+        path: "",
         auth: true,
         component: view.Millionare,

[Survived] BooleanLiteral
src/app/routes/routes.tsx:50:15
 
     {
         path: '/millionare',
-        auth: true,
+        auth: false,
         component: view.Millionare,
     }
