[Survived] BlockStatement
src/app/views/Crossword.tsx:3:32
 import React from 'react';
 
-export const Crossword = () => {
-    return (
-        <div>
-            Crossword
-        </div>
-    )
-}
+export const Crossword = () => {}
