[Survived] BlockStatement
src/app/views/Edit.tsx:3:27
 import React from 'react';
 
-export const Edit = () => {
-    return (
-        <div>
-            Edit profile page
-        </div>
-    )
-}
+export const Edit = () => {}
