[Survived] BlockStatement
src/app/views/Millionaire.tsx:3:33
 import React from 'react';
 
-export const Millionare = () => {
-    return (
-        <div>
-            Millionare
-        </div>
-    )
-}
+export const Millionare = () => {}
