[Survived] BlockStatement
app/views/Profile/Profile.tsx:5:30
 import { User, Games } from '../../components';
 import './Profile.scss';
 
-export const Profile = () => {
-  return (
-    <Fragment>
-      <div className = 'profile'>
-        <User />
-        <Games />
-      </div>
-    </Fragment>
-  );
-};
+export const Profile = () => {};
 
