[Survived] BlockStatement
src/app/views/Song.tsx:3:27
 import React from 'react';
 
-export const Song = () => {
-    return (
-        <div>
-            Song
-        </div>
-    )
-}
+export const Song = () => {}
